Revit 2024 API
OpenForeignOption Enumeration
 Options for opening files saved by an application that was not developed or licensed by Autodesk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.2
Syntax
C#
public enum OpenForeignOption
Visual Basic
Public Enumeration OpenForeignOption
Visual C++
public enum class OpenForeignOption
Members
Member name | Description
Open |  Do not show any prompt to the user if a foreign file is detected. Proceed to open.
DoNotOpen |  Do not show any prompt to the user if a foreign file is detected. Cancel this operation (do not open the file).
Prompt |  If possible, show a prompt to the user if a foreign file is detected. The operation may proceed or cancel based on the response.
See Also
Autodesk.Revit.DB Namespace